spec/fixtures/vcr_cassettes/Transaction/Class_Methods/_charge_invoices_by_user_id/invoice_with_15_failed_transactions_or_more/doesn_t_try_to_charge_the_invoice.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=J02KRYZF&CARDNO=4111111111111111&CN=John+Doe+Huber&CVC=111&ECI=7&ED=0914&EMAIL=email40%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PARAMPLUS=CHECK_CC_USER_ID%3D1114&PSPID=jilion&PSWD=WWQMNC89&SHASign=11FD9799404DC6976007802C3CF563F321E30B14A0D75F6A4C8AD2A7AAA29485E653038B2DB9345244BD9335815FF304DC6BA5931F02F1945BCD3DC1465778D7&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=a9ce4125791ee8d32d90a8d661eed7&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:31 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:29 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291602_1718442;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"a9ce4125791ee8d32d90a8d661eed7\"\r\nPAYID=\"23938565\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"J02KRYZF\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:31 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938565&PSPID=jilion&PSWD=WWQMNC89&SHASign=86A0EAD0D7C4326BA81E3AA3BD11D3CDD53C44FF77934B171CFD0650DD908D88B4473ABD970ACCCA8D08CA19B87D419371F649560ABB2D4E8B847797BB37736A&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:31 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:31 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869344847_1718442;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"a9ce4125791ee8d32d90a8d661eed7\"\r\nPAYID=\"23938565\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:31 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938565&PSPID=jilion&PSWD=WWQMNC89&SHASign=86A0EAD0D7C4326BA81E3AA3BD11D3CDD53C44FF77934B171CFD0650DD908D88B4473ABD970ACCCA8D08CA19B87D419371F649560ABB2D4E8B847797BB37736A&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:32 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:31 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1868291640_1718442;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"a9ce4125791ee8d32d90a8d661eed7\"\r\nPAYID=\"23938565\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:32 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=1594JJ3Y&CARDNO=4111111111111111&CN=John+Doe+Huber&CVC=111&ECI=7&ED=0914&EMAIL=email41%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=1004&Owneraddress=Avenue+de+France+71&PARAMPLUS=CHECK_CC_USER_ID%3D1115&PSPID=jilion&PSWD=WWQMNC89&SHASign=CD08BC17BDBEB04F868772A65FBBB29187F6BEC45D88B5D9D38B378C8BF9F1EEE0E52B0134FA5F71EF913C499C2990DDA1C2B17C0DE79AEBFAC9732BDB9941D4&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=762ed7e0fd7f04a5a25538b8548f36&ownercty=CH&ownertown=Lausanne
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:33 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:32 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869344971_1718444;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"762ed7e0fd7f04a5a25538b8548f36\"\r\nPAYID=\"23938568\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"1594JJ3Y\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:33 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938568&PSPID=jilion&PSWD=WWQMNC89&SHASign=8F54BE6B26268B5676C54AD012CD3021278D5BB4E24F208E4388A6C53D8EEF943A6838ADA88D0C267044E16E2452419D45B5D03681648D03FE4E9840C77FE9E8&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:34 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:34 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869344999_1718445;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"762ed7e0fd7f04a5a25538b8548f36\"\r\nPAYID=\"23938568\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:34 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=23938568&PSPID=jilion&PSWD=WWQMNC89&SHASign=8F54BE6B26268B5676C54AD012CD3021278D5BB4E24F208E4388A6C53D8EEF943A6838ADA88D0C267044E16E2452419D45B5D03681648D03FE4E9840C77FE9E8&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 26 Sep 2013 14:25:34 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Thu, 26 Sep 2013 14:24:34 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_4218234546_0=1869345021_1718445;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"762ed7e0fd7f04a5a25538b8548f36\"\r\nPAYID=\"23938568\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Thu, 26 Sep 2013 14:25:34 GMT
recorded_with: VCR 2.6.0
